app/controllers/products_controller.rb

  def create
    @product = Product.new(params[:product])

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("price", "created_at", "title", "image_url", "updated_at", "description") VALUES(28.5, '2010-08-11 21:15:04', 'Pragmatic Version Control', '/images/svn.jpg', '2010-08-11 21:15:04', 'This book is a recipe-based approach to using Subversion that will