app/controllers/store_controller.rb

  def save_order
    @cart = find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save
---
INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(2, '2010-09-01 15:06:16', 570.0, 2, 2, '2010-09-01 15:06:16')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('nombre de la orden ', '2010-09-01 15:06:16', 'cc', 'villarroal 1306', 'pablo@pablo.com', '2010-09-01 15:06:16')