app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])

    #respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("name", "salt", "updated_at", "hashed_password", "created_at") VALUES('pablo', '-6176678080.512589612632224', '2010-09-01 16:09:51', '4d23695f87f6c6289d7ebb898185adbd2b83bc27', '2010-09-01 16:09:51')